Repository: applingua/WelshAppTMX
Catalog: Welsh App TMX by Applingua Ltd.tmx
Source language: en
Languages: cy

source: Instant Gratification
cy: Hunanfoddhad ar unwaith

source: Yay! Video sent via SMS.
cy: Hwre! Anfonwyd y fideo trwy SMS.

source: Overdue
cy: Hwyr

source: Overdue after (days)
cy: Hwyr ar ôl (diwrnod)

source: Duration
cy: Hyd

source: Length
cy: Hyd

source: Up to %@ off!
cy: Hyd at %@ i ffwrdd!

source: Minimum duration
cy: Hyd byrraf

source: Len,Ang
cy: Hyd,Ong

source: Duration:
cy: Hyd:

source: Duration, %@
cy: Hyd: %@

source: October
cy: Hydref

source: Training
cy: Hyfforddiant

source: Coaches
cy: Hyfforddwyr

source: Promo
cy: Hyrwyddiad

source: Promos
cy: Hyrwyddiadau

source: New %1$s notification
cy: Hysbysiad %1$s newydd

source: Daily Reminder Notification
cy: Hysbysiad atgoffa dyddiol

source: Legal Notice
cy: Hysbysiad cyfreithiol

source: Health Task Notification
cy: Hysbysiad tasg iechyd

source: Notifications
cy: Hysbysiadau

source: Notifications and Sounds
cy: Hysbysiadau a Synau

source: Push Notifications
cy: Hysbysiadau Gwthio

source: Notify
cy: Hysbysu

source: Notify on these events:
cy: Hysbysu am y digwyddiadau hyn:

source: informed when offline
cy: hysbysu heb gysylltiad

source: Notify me when a facebook friend joins [APPNAME]
cy: Hysbyswch fi pan mae rhywun ffrind facebook yn ymuno â [APPNAME]

source: Notify me when someone mentions me
cy: Hysbyswch fi pan mae rhywun yn sôn amdanaf

source: to
cy: i

source: To take a screenshot, hold the sleep and home button and it will be saved to your camera roll.
cy: I dynnu sgrinlun, daliwch y botwm cysgu a'r botwm hafan a bydd yn cael ei anfon i'r rhôl camera.

source: to Facebook
cy: i Facebook

source: Off
cy: I ffwrdd

source: Up
cy: I fyny

source: To get Daily Reminders, please allow Notifications in your phone Settings
cy: I gael negeseuon atgoffa dyddiol, caniatewch hysbysiadau yng ngosodiadau eich ffôn

source: For best results we recommend turning Bluetooth ON
cy: I gael y canlyniadau gorau argymhellwn droi Bluetooth YMLAEN

source: Down
cy: I lawr

source: IN
cy: I MEWN

source: to Twitter
cy: i Twitter

source: For relax and fun
cy: I ymlacio a chael hwyl

source: To: %@
cy: I: %@

source: Language
cy: Iaith

source: Zeus
cy: Iau

source: Got It
cy: Iawn

source: GOT IT
cy: IAWN

source: OK
cy: Iawn

source: Okay
cy: Iawn

source: Ok, I will try again
cy: Iawn, fe geisiaf eto

source: OK, fine I'll do it myself !
cy: Iawn, fe wna'i wneud e fy hun!

source: Ok, let’s get started by tracking down some interesting places nearby.
cy: Iawn, gadewch i ni ddechrau arni trwy ddod o hyd i rai lleoedd diddorol gerllaw.

source: OK, I’m ready!
cy: Iawn, rwy'n barod!

source: OK, got it
cy: Iawn, rwy'n deall

source: Okay, got it
cy: Iawn, rwy'n deall

source: Ok, sure
cy: Iawn, wrth gwrs

source: Got it!
cy: Iawn!

source: Yes!
cy: Iawn!

source: Got It Right?
cy: Iawn?

source: iCloud Unavailable
cy: iCloud ddim ar gael

source: iCloud is unavailable. Please check your device settings and try again.
cy: iCloud ddim ar gael. Gwiria osodiadau dy ddyfais a rho gynnig arall arni.

source: Employee ID
cy: ID Gweithiwr

source: YES, CORRECT
cy: IE, CYWIR

source: YES, DELETE
cy: IE, DILEU

source: Yes, rate it now!
cy: Ie, rhoi sgôr nawr!

source: Yeah!
cy: Ie!

source: HEALTH & FITNESS
cy: IECHYD A FFITRWYDD

source: Languages
cy: Ieithoedd

source: ADDITIONAL LANGUAGES
cy: IEITHOEDD YCHWANEGOL

source: January
cy: Ionawr

source: iOS 9 ready!
cy: iOS 9 yn barod!

source: Low
cy: Isel

source: Below
cy: Isod

source: Tip Jar
cy: Jar Tipiau

source: Jungle
cy: Jyngl

source: Just chilling.
cy: Jyst yn ymlacio.

source: KgF*M/Sec
cy: KgF*M/Eil

source: Km/Hour
cy: Km/Awr

source: Km/Sec
cy: Km/Eil

source: Km/Sec²
cy: Km/Eil²

source: Km/Min
cy: Km/Mun

source: KMH
cy: KMYH

source: Duration orientation
cy: Label cyfeiriadedd

source: Duration label
cy: Label hyd

source: More d[APPNAME]iled time labels on Then as you zoom in.
cy: Labeli amser mwy manwl ar Wedyn wrth i chi nesáu.

source: High contrast labels
cy: Labeli cyferbyniad uchel

source: Laboratory
cy: Labordy

source: Llamas saved
cy: Lamas a arbedwyd

source: Llamas collected
cy: Lamas a gasglwyd

source: Alarms
cy: Larymau

source: Automatic Alarms
cy: Larymau awtomatig

source: Automatic Alarms Enabled
cy: Larymau awtomatig wedi'u galluogi

source: Latvia
cy: Latfia

source: Download Failed
cy: Lawrlwythiad wedi methu

source: Download
cy: Lawrlwytho

source: Download [APPNAME] Pro from the App Store
cy: Lawrlwytho [APPNAME] Pro o'r App Store

source: Download free at
cy: Lawrlwytho am ddim ar

source: Download problem
cy: Lawrlwytho problem

source: Download this course to learn offline?
cy: Lawrlwytho'r cwrs hwn i ddysgu heb gysylltu?

source: Please download it now and enjoy the new updates.
cy: Lawrlwythwch hi nawr i fwynhau'r diweddariadau newydd.

source: Download the app for free now!
cy: Lawrlwythwch yr ap am ddim nawr!

source: Lb*Ft
cy: Lb*Troedfeddi

source: LbF*Inches
cy: LbF*Modfeddi

source: LbF*Ft
cy: LbF*Troedfeddi

source: LbF/Inches²
cy: LbF/Modfedd²

source: LbF/Ft²
cy: LbF/Troedfedd²

source: Level
cy: Lefel

source: Level {0}
cy: Lefel {0}

source: Level %@/%@
cy: Lefel %@/%@

source: Viewing level, %@
cy: Lefel bresennol, %@

source: Viewing level:
cy: Lefel gyfredol:

source: Levels
cy: Lefelau

source: LVL
cy: LFL

source: Lithuania
cy: Lithwania

source: Litre
cy: Litr

source: Litres
cy: Litr

source: Latin
cy: Lladin

source: Highway Robbery
cy: Lladrad Pen Ffordd

source: LABOR
cy: LLAFUR

source: Less than
cy: Llai na

source: Less than or equal
cy: Llai na neu'n gyfartal

source: Less Attacks
cy: Llai o Ymosodiadau

source: Yards
cy: Llathenni

source: Manual
cy: Llawlyfr

source: excited
cy: llawn cyffro

source: Freehand
cy: Llawrydd

source: Loc,Size
cy: Lle,Mai

source: Width
cy: Lled

source: Spread the Word!
cy: Lledaenwch y gair!

source: Spread some love
cy: Lledaenwch yr hwyl

source: Graverobber
cy: Lleidr Beddi

source: Minimize
cy: Lleihau

source: Humidity
cy: Lleithder

source: Fill
cy: Llenwad

source: Fill To Mixer
cy: Llenwad i'r cymysgydd

source: Please fill in all fields
cy: Llenwch bob maes

source: Fill your info
cy: Llenwch eich gwybodaeth

source: Fill up with fuel
cy: Llenwi â tanwydd

source: Decimal Places
cy: Lleoedd degol

source: Nearby Places
cy: Lleoedd gerllaw

source: Local
cy: Lleol

source: Location
cy: Lleoliad

source: Current Location
cy: Lleoliad Cyfredol

source: Custom Location
cy: Lleoliad personol

source: Widget Location
cy: Lleoliad y gydran

source: Text Location
cy: Lleoliad y testun

source: Watch Location
cy: Lleoliad yr Oriawr

source: Locations
cy: Lleoliadau

source: Hospitality
cy: Lletygarwch

source: Moon
cy: Lleuad

source: Line
cy: Llinell

source: Timeline
cy: Llinell amser

source: Dashes
cy: Llinellau toredig

source: Linear
cy: Llinellol

source: Etch
cy: Llingerfiad

source: Color
cy: Lliw

source: Colour
cy: Lliw

source: Automatic colour
cy: Lliw awtomatig

source: Color Overdue Dates
cy: Lliw dyddiadau hwyr

source: Transparent color
cy: Lliw tryloyw

source: Fill color
cy: Lliw y llenwad

source: Icon Color
cy: Lliw yr eicon

source: Colors
cy: Lliwiau

source: Opposite colors substract
cy: Lliwiau gyferbyn â'i gilydd yn tynnu i ffwrdd

source: Merchant Ship
cy: Llong Masnachol

source: Pirate Ship
cy: Llong Môr-ladron

source: Ghost Ship
cy: Llong Rithiol

source: CONGRATULATIONS
cy: LLONGYFARCHIADAU

source: Congratulations! You have completed all the goals!
cy: Llongyfarchiadau! Rwyt ti wedi cwblhau'r holl nodau!

source: Horizontal
cy: Llorweddol

source: Burn %@ Calorie
cy: Llosgi %@ Calori

source: Burn %@ Calories
cy: Llosgi %@ Calori

source: Mon
cy: Llun

source: Photo
cy: Llun

source: Facebook photo
cy: Llun Facebook

source: Instagram photo
cy: Llun Instagram

source: Twitter photo
cy: Llun Twitter

source: MON, MAY 25, 2015
cy: LLUN, 25 MAI 2015

source: London, UK
cy: Llundain, DU

source: Photocopies of passport and insurance policy
cy: Llungopïau o'ch pasbort a pholisi yswiriant

source: Photos
cy: Lluniau

source: Multiply / Divide
cy: Lluosi / Rhannu

source: Drag it to where you want.
cy: Llusgwch hi i le rydych chi eisiau.

source: Drag the slider to set the minimum altitude of passes you'd like to be notified about.
cy: Llusgwch y llithrydd i osod uchder isaf y teithiau hoffech chi gael gwybod am.

source: Coffee Spoons
cy: Llwyau Coffi

source: Expedition
cy: Llwybr

source: Path
cy: Llwybr

source: Route
cy: Llwybr

source: Path on your FTP server (case sensitive). The path folders must exist on the server.
cy: Llwybr ar eich gweinydd FTP (llythrennau bach/mawr). Rhaid i lwybrau'r ffolderi fodoli ar y gweinydd.

source: Paths to Victory
cy: Llwybrau at Fuddugoliaeth

source: Grey
cy: Llwyd

source: Light Grey
cy: Llwyd golau

source: Success
cy: Llwyddiant

source: Load Past Requests…
cy: Llwytho ceisiadau blaenorol…

source: Library
cy: Llyfrgell

source: Photo Library
cy: Llyfrgell luniau

source: Libraries
cy: Llyfrgelloedd

source: Fisheye
cy: Llygad Pysgodyn

source: King's Court
cy: Llys y Brenin

source: Embassy
cy: Llysgenhadaeth

source: Envoy
cy: Llysgennad

source: Letter
cy: Llythyr

source: Navigator
cy: Llywiwr

source: Governor
cy: Llywodraethwr

source: Logo (prefer size 75x75 px)
cy: Logo (maint gorau 75 x 75 px)

source: Premium Lounge
cy: Lolfa Bremiwm

source: LOUNGES
cy: LOLFEYDD

source: Mid Lane
cy: Lôn Ganol

source: Lumens/Cm²
cy: Lwmen/Cm²

source: Lumens/M²
cy: Lwmen/M²

source: Lumens/Ft²
cy: Lwmen/Tr²

source: M/Sec²
cy: M/Eil²

source: Sunset
cy: Machlud haul

source: Wants to be your friend!
cy: Mae … eisiau bod yn ffrind i chi!

source: No developers were harmed in the making of this app.
cy: Mae [APPNAME] wedi'i seilio ar stori wir.

source: [APPNAME] export entries as CSV (Excel) file
cy: Mae [APPNAME] yn allgludo cofnodion fel ffeil CSV (Excel)

source: [COMPANY NAME] is a company registered in [COUNTRY] with company number [NUMBER]
cy: Mae [COMPANY NAME] yn gwmni wedi'i gofrestru yn yr [COUNTRY] gyda'r rhif cwmni [NUMBER]

source: {0} is now on level {1} of {2}!
cy: Mae {0} nawr ar lefel {1} o {2}!

source: %@' is invalid number
cy: Mae \%@' yn rhif annilys

source: %@ is now following you
cy: Mae %@ bellach yn eich dilyn

source: %@ has been running for %@, and this is the last reminder for today.
cy: Mae %@ wedi bod yn rhedeg am %@, a dyma'r nodyn atgoffa olaf ar gyfer heddiw.

source: %@ has been running for %@.
cy: Mae %@ wedi bod yn rhedeg am %@.

source: %@ is following You.
cy: Mae %@ yn eich dilyn.

source: %s is now following you.
cy: Mae %s bellach yn eich dilyn.

source: %s wants to be your friend.
cy: Mae %s eisiau bod yn ffrind i chi.

source: %s left the group
cy: Mae %s wedi gadael y grŵp

source: %s joined the group
cy: Mae %s wedi ymuno â'r grŵp

source: %s is recording
cy: Mae %s yn recordio

source: Modifying a photo clears the edit history. Are you sure you want to continue?
cy: Mae addasu llun yn clirio'r hanes golygu. Ydych chi'n siŵr eich bod am barhau?

source: Reviews enable us to spend more time improving the app.
cy: Mae adolygiadau yn ein galluogi i dreulio mwy o amser yn gwella'r ap.

source: Crash reporting is built in.
cy: Mae adroddiadau chwalu wedi'u hymgorffori.

source: Open in… works with any apps that open CSV files, or PNG images.
cy: Mae Agor yn… yn gweithio gydag unrhyw apiau sy'n agor ffeiliau CSV, neu ddelweddau PNG.

source: A Dropbox export is already in progress. Do you want to abort that?
cy: Mae'r broses o allgludo Dropbox eisoes ar y gweill. Ydych chi eisiau terfynu'r broses?

source: Time is required.
cy: Mae angen amser.

source: Network connection required to move to iCloud.
cy: Mae angen cysylltiad rhwydwaith er mwyn symud i iCloud.

source: An internet connection is required to setup [APPNAME]. Please check your connection and try again.
cy: Mae angen cysylltiad rhyngrwyd i osod [APPNAME]. Gwiriwch eich cysylltiad a rhowch gynnig arall arni.

source: a first and a last name are needed
cy: mae angen enw cyntaf a chyfenw

source: You need to restart the app for the changes to take effect
cy: Mae angen i chi ailgychwyn yr ap er mwyn i'r newidiadau weithio

source: You need to logout only if you want to switch to another Cloud user. Do you want to switch to another Cloud user?
cy: Mae angen i chi allgofnodi os ydych chi eisiau newid i ddefnyddiwr arall o'r Cloud. Ydych chi eisiau newid i ddefnyddiwr arall o'r Cloud?

source: You need to be authorized in Facebook for synchronization. Authorize now?
cy: Mae angen i chi fod wedi awdurdodi yn Facebook ar gyfer cysoni. Awdurdodi nawr?

source: You need to have iOS8 in order to log in using iCloud
cy: Mae angen i chi gael iOS8 er mwyn mewngofnodi gan ddefnyddio iCloud

source: This field is required
cy: Mae angen llenwi'r maes hwn

source: a location is needed
cy: mae angen lleoliad

source: Access to your address book required
cy: Mae angen mynediad at eich llyfr cyfeiriadau

source: It's now simpler to choose just what you want to see on the schedule. Use the tool bar above to filter the visible shifts by Position, Employee, Location or Job Site.
cy: Mae bellach yn symlach dewis beth rydych chi eisiau gweld ar yr amserlen. Defnyddiwch y bar offer i hidlo'r sifftiau sy'n weladwy yn ôl Swydd, Gweithiwr, Lleoliad neu Safle.

source: Copper produces an extra 1 Coin this turn.
cy: Mae copr yn cynhyrchu 1 Darn Arian ychwanegol y tro hwn.

source: A different iCloud account is logged in. Sync will resume when logged in to the original account.
cy: Mae cyfrif iCloud gwahanol wedi mewngofnodi. Bydd y cysoni yn ailgychwyn pan fydd y cyfrif gwreiddiol wedi mewngofnodi.

source: Connecting a device to iCloud can be slow.
cy: Mae cysylltu dyfais i iCloud yn gallu bod yn araf.

source: Following personalises your experience
cy: Mae dilyn yn personoli'ch profiad

source: Dropbox is disabled.
cy: Mae Dropbox wedi'i analluogi.

source: This device's current date and time differs from [APPNAME]'s clock by a significant amount.
cy: Mae dyddiad ac amser cyfredol y ddyfais yma yn wahanol iawn i gloc [APPNAME].

source: Learning's a game. Plant new information as 'seeds' in your memory - then complete tests to help them grow into strong 'flowers' in your long term memory.
cy: Mae dysgu fel gêm. Plannwch wybodaeth newydd fel 'hadau' yn eich cof - yna cwblhewch brofion i'w helpu i dyfu i fod yn 'flodau\ cryf ' yn eich cof tymor hir.

source: An email has been sent to you with instructions on completing your password reset.
cy: Mae e-bost wedi'i anfon atoch gyda chyfarwyddiadau ar sut i ailosod eich ailosod.

source: Your battery is safe!
cy: Mae eich batri yn ddiogel!

source: Your dropbox account has been unlinked
cy: Mae eich cyfrif dropbox wedi cael ei datgysylltu

source: Your account is connected to Facebook
cy: Mae eich cyfrif wedi'i gysylltu â Facebook

source: Your data is
cy: Mae eich data yn

source: A name is required.
cy: Mae enw'n ofynnol.

source: Expense name is empty
cy: Mae enw'r gost yn wag

source: A new version of [APPNAME] is available
cy: Mae fersiwn newydd o [APPNAME] ar gael

source: Favorite already exists with that title, please enter a new one
cy: Mae ffefryn eisoes yn bodoli gyda'r teitl hwnnw, nodwch un newydd

source: Frontback is better with your friends!
cy: Mae Frontback yn well gyda'ch ffrindiau!

source: Frontback is better when you follow more people.
cy: Mae Frontback yn well pan rydych yn dilyn mwy o bobl.

source: My profile is private
cy: Mae fy mhroffil yn breifat

source: My Trip from %@ (%@) to %@ (%@) is scheduled to depart at %@ and arrives at %@
cy: Mae fy nhaith o %@ (%@) i %@ (%@) i fod i adael am %@ ac yn cyrraedd am %@

source: My predictions are due
cy: Mae fy rhagfynegiadau yn ddyledus

source: I already have an account
cy: Mae gen i gyfrif yn barod

source: You've got a %@ drive to get to %@
cy: Mae gennych chi daith o %@ mewn car i gyrraedd %@

source: You have unread messages in %d conversations
cy: Mae gennych negeseuon heb eu darllen mewn %d sgwrs

source: You have unread messages in 1 conversation
cy: Mae gennych negeseuon heb eu darllen mewn 1 sgwrs

source: I HAVE A PROBLEM
cy: MAE GENNYF BROBLEM

source: I HAVE AN IDEA
cy: MAE GENNYF SYNIAD

source: This is in addition to the backups you get by using iCloud sync.
cy: Mae hyn yn ychwanegol at y copïau wrth gefn a gewch drwy ddefnyddio cysoni iCloud.

source: iCloud is disabled.
cy: Mae iCloud wedi'i analluogi.

source: iTunes, iCloud, iPhone, iPad and iPod touch are trademarks of Apple Inc.
cy: Mae iTunes, iCloud, iPhone, iPad ac iPod touch yn nodau masnach Apple Inc.

source: A Dropbox download is already in progress. Do you want to abort that?
cy: Mae lawrlwythiad Dropbox eisoes ar y gweill. Ydych chi eisiau terfynu'r broses?

source: Free was found on your device.
cy: Mae lle ar eich dyfais.

source: Locations are like different schedules. A location can represent a physical location or a department (e.g. Downtown, Uptown, BOH, FOH, etc.) Employees can be assigned to single or multiple locations.
cy: Mae lleoliadau fel amserlenni gwahanol. Mae lleoliad yn gallu cynrychioli lleoliad corfforol neu adran (e.e. Canol y Dref, Gogledd y Dref, Cefn y Tŷ, Blaen y Tŷ.) Mae gweithwyr yn gallu cael eu neilltuo i un lleoliad neu ragor.

source: Mems are like fertiliser for memories: they help them grow fast and strong!
cy: Mae mems fel gwrtaith ar gyfer atgofion: maen nhw'n eu helpu i dyfu'n gyflym ac yn gryf!

source: It is as simple as 1-2-3!
cy: Mae mor syml â 1-2-3!

source: More than one version of this map has been saved. Please choose a version to keep.
cy: Mae mwy nag un fersiwn o'r map hwn wedi cael ei gadw. Dewiswch fersiwn i'w gadw.

source: A Message is required.
cy: Mae neges yn ofynnol.

source: Pending changes are pushed to iCloud when the app goes into the background, assuming a working network connection.
cy: Mae newidiadau sy'n disgwyl yn cael eu gwthio i iCloud pan fydd yr ap yn mynd i'r cefndir, gan dybio cysylltiad rhwydwaith sy'n gweithio.

source: There are a number of ways to edit events:
cy: Mae nifer o ffyrdd i olygu digwyddiadau:

source: Each player (including you) reveals the top 2 cards of his deck, and you choose one: either he discards them, or he puts them back on top in an order he chooses.&#10;&#10;+2 Cards
cy: Mae pob chwaraewr (gan gynnwys chi) yn datgelu'r 2 gerdyn ar dop eu pecyn, ac rydych chi'n dewis un: naill ai maen e'n cael gwared ohonynt, neu mae e'n eu rhoi yn ôl ar y top mewn trefn mae e'n dewis.&#10;&#10;+2 Gerdyn

source: Project with the same name already exist
cy: Mae prosiect gyda'r un enw eisoes yn bodoli

source: Purchases are subject to the [APPNAME] Terms of Service.
cy: Mae pryniannau yn destun Telerau Gwasanaeth [APPNAME].

source: Something is wrong. Please check all fields and try again
cy: Mae rhywbeth o'i le. Gwiriwch bob maes a rhowch gynnig arall arni

source: Something is wrong. Please check your login details
cy: Mae rhywbeth o'i le. Gwiriwch eich manylion mewngofnodi

source: You have some data on this device. Your data will be replaced with data from the cloud, do you want to proceed?
cy: Mae rhywfaint o ddata gennych ar y ddyfais hon. Bydd eich data yn cael ei ddisodli gyda data o'r cwmwl, ydych chi eisiau parhau?

source: Comments are posted
cy: Mae sylwadau yn cael eu postio

source: There are unsaved changes.
cy: Mae yna newidiadau sydd heb eu cadw.

source: Your contacts, photos, and all other personal data are safe.
cy: Mae'ch cysylltiadau, lluniau, a'r holl ddata personol eraill yn ddiogel.

source: Your reminder has been successfully saved!
cy: Mae'ch nodyn atgoffa wedi cael ei chadw'n llwyddiannus!

source: Your wishlist is still empty.
cy: Mae'ch rhestr dymuniadau dal yn wag.

source: I’m sorry for any inconvenience.
cy: Mae'n ddrwg gennyf am unrhyw anghyfleustra.

source: Sorry, this %{TYPE} doesn't exist.
cy: Mae'n flim gennym, nid yw'r %{TYPE} hwn yn bodoli.

source: We're sorry - something has gone wrong, be back shortly.
cy: Mae'n flin gennym - aeth rhywbeth o'i le, byddwn yn ôl cyn bo hir.

source: Sorry, but the map could not be imported.
cy: Mae'n flin gennym ond ni ellir mewngludo'r map.

source: Sorry, but the map could not be shared. Please try again later.
cy: Mae'n flin gennym ond ni ellir rhannu'r map. Rhowch gynnig arall arni yn nes ymlaen.

source: Sorry, you currently have no internet connection, to view this feature please connect to WIFI or your cellular network.
cy: Mae'n flin gennym, ar hyn o bryd does gyda chi dim cysylltiad rhyngrwyd, i weld y nodwedd hon cysylltwch â diwifr neu eich rhwydwaith symudol.

source: Sorry, there's nothing to display.
cy: Mae'n flin gennym, does dim byd i'w arddangos.

source: Sorry, there is no connection.
cy: Mae'n flin gennym, does dim cysylltiad.

source: Sorry, there appears to be no network connection!
cy: Mae'n flin gennym, mae'n ymddangos fel nad oes cysylltiad â'r rhwydwaith!

source: Sorry, you can't purchase a premium subscription at the moment.
cy: Mae'n flin gennym, ni allwch brynu tanysgrifiad premiwm ar hyn o bryd.

source: Sorry, but we couldn't find a sufficiently accurate location.
cy: Mae'n flin gennym, ni allwn ddod o hyd i leoliad digon cywir.

source: Sorry, no suggested locations could be found in your area
cy: Mae'n flin gennym, ni ellir dod o hyd i unrhyw leoliadau awgrymedig yn eich ardal

source: Sorry, unable to connect to Facebook at this time.
cy: Mae'n flin gennym, nid oeddem yn gallu cysylltu â Facebook ar yr adeg hon.

source: Sorry, we were unable to invite your friend this time.
cy: Mae'n flin gennym, nid oeddem yn gallu gwahodd eich ffrindiau ar yr adeg hon.

source: Sorry, the two password fields don't match
cy: Mae'n flin gennym, nid yw'r ddau gyfrinair yn cyfateb

source: Sorry, there was an error with the request!
cy: Mae'n flin gennym, roedd gwall gyda'r cais!

source: Sorry, there was an error retrieving your details!
cy: Mae'n flin gennym, roedd gwall wrth adfer eich manylion!

source: Sorry, there was an error loading the content!
cy: Mae'n flin gennym, roedd gwall wrth lwytho'r cynnwys!

source: Sorry, there was an error loading the session!
cy: Mae'n flin gennym, roedd gwall wrth lwytho'r sesiwn!

source: Sorry, your new password appears to be too short!
cy: Mae'n flin gennym, ymddengys bod eich cyfrinair newydd yn rhy fyr!

source: Sorry, your password appears to be invalid!
cy: Mae'n flin gennym, ymddengys bod eich cyfrinair yn annilys!

source: Sorry, your password appears to be less than 6 characters!
cy: Mae'n flin gennym, ymddengys bod eich cyfrinair yn cynnwys llai na 6 nod!

source: Sorry, your email appears to be invalid!
cy: Mae'n flin gennym, ymddengys bod eich ebost yn annilys!

source: Sorry, your username appears to be invalid!
cy: Mae'n flin gennym, ymddengys bod eich enw defnyddiwr yn annilys!

source: Sorry, your old password appears to be too short!
cy: Mae'n flin gennym, ymddengys bod eich hen gyfrinair yn rhy fyr!

source: Sorry! You need to setup an email account on your device for this.
cy: Mae'n flin gennym! Mae angen i chi osod cyfrif e-bost ar eich dyfais i wneud hyn.

source: Very sorry, but looks like purchasing is not allowed from this account.
cy: Mae'n flin iawn gennym, ond ymddengys na chaniateir prynu o'r cyfrif hwn.

source: It Helps a Lot
cy: Mae'n helpu'n fawr

source: For good measure reboot your device by holding down the sleep/wake button and the home button until you see a blank screen with the Apple logo.
cy: Mae'n syniad da i ailgychwyn eich dyfais gan ddal y botwm cysgu/deffro a'r botwm hafan i lawr tan i chi weld sgrin wag gyda logo Apple.

source: He discards the other revealed cards.
cy: Mae'n taflu'r cardiau eraill y'u datgelwyd.

source: He trashes that card and may gain a card costing at most 2 Coins less than it.
cy: Mae'n taflu'r cerdyn hwnnw a gall ennill cerdyn sy'n costio, ar y mwyaf, 2 Ddarn Arian yn llai.
